app/Controllers/AuthenticationController.php

    public function Login()
    {
        $email = $this->request->getVar('email');
        $password = $this->request->getVar('password');
        //2. Cocokkan Dengan Yang Ada DiDatabase
        $user = $this->akunmodel->where(['email_pengguna' => $email])->first();
---
SELECT *
FROM `akun`
WHERE `email_pengguna` = 'fiqri@gmail.com'
 LIMIT 1