app/Controllers/PagesController.php

SELECT *
FROM `pelaporan`
WHERE `status_pelaporan` NOT LIKE '%Laporan Telah Dikirim%' ESCAPE '!'
---
    public function dashboard()
    {
        if (session()->get('role') == 1 || session()->get('role') == 2) {
            $data = [
                'title' => "Dashboard - Lakjasi",
                'nama'  => session()->get('nama'),
                'totalakun' => $this->akun->getAllAkun(),
                'totalpelaporan' => $this->pelaporan->getAllPelaporan(),
                'lokasi' => $this->pelaporan->notLike('status_pelaporan', 'Laporan Telah Dikirim')->findAll()

SELECT *
FROM `pelaporan`
WHERE `id_akun` = '24'
---
    public function riwayat_pelaporan()
    {
        if (session()->get('role') == 1) {
            $data = [
                'title' => "Riwayat Pelaporan - Lakjasi",
                'nama' => session()->get('nama'),
                'pelaporan' => $this->pelaporan->where('id_akun', session()->get('id'))->findAll()
            ];
            return view('riwayat-pelaporan', $data);
        } elseif (session()->get('role') == 2) {
            $data = [
                'title' => "Riwayat Pelaporan - Lakjasi",
                'nama' => session()->get('nama'),
                'pelaporan' => $this->pelaporan->where('id_akun', session()->get('id'))->findAll(),